package day0219;
// 자바의 이름짓는 규칙
// 1. 자바는 대소문자를 엄격하게 구분한다.
//    즉, COntroller와 Controller는 서로 다른 존재라는 의미가 된다.
// 2. 무언가의 이름을 지어줄때 _를 제외한 특수문자는 사용할 수 없다.
// 3. 이름의 중간이나 끝에 숫자가 올 수 있지만
//    숫자로 이름을 시작할 수는 없다.
// 4. 한글로 이름을 지어줄 수는 있지만 한글 이름은 절대로 사용하지말자.
// 5. 자바에서는 내부적으로 기능이 정의되어있는 50가지의 단어들이 있다.
//    해당 단어를 우리는 키워드(예약어)라고 부른다.
//    키워드로는 우리가 이름을 지어줄 수 없다.
//    그러니 외웁시다(월요일 10시에 시험) -> 옛날 이야기...
//    이클립스에서는 키워드가 자주색으로 표시된다.
//    만약 여러분이 무언가의 이름을 지어줬는데 자주색으로 표시될 경우
//    그 이름에 변형을 가하거나 동의어를 사용하면된다!!!
// 6. 낙타등 표기법 vs 뱀 표기법
//    A. 낙타등 표기법(Camel back notation)
//       낙타등 표기법이란 이름이 여러 단어로 이루어져 있는 경우
//       두번째 단어부터는 첫글자를 대문자로 써서 단어의 구별을 쉽게 할 수 있게
//       하는 표기법이다.
//    B. 뱀 표기법(snake notation)
//    뱀 표기법이란 모든 글자를 대문자로 적어주고 이름이 여러 단어일 때
//    단어의 사이마다 _를 넣어서 단어의 구별을 쉽게 할 수 있게
//    하는 표기법이다.

// 각각의 경우에 대한 이름 짓는 규칙
// 1. 클래스
//    클래스는 대문자로 시작하고 낙타등 표기법을 사용하는 명사이다.
// 2. 상수
//    상수는 모든 글자를 대문자로 적고 뱀 표기법을 사용하는 명사이다.
// 3. 메소드
//    메소드는 소문자로 시작하고 낙타등 표기법을 사용하는 동사이다.
//    단 메소드의 경우, 프로그래밍 규칙상 반드시 이름 뒤에 ()가 붙는다.
// 4. 변수
//    변수는 소문자로 시작하고 낙타등 표기법을 사용하는 명사이다.
public class Ex02NamingConvention {
    // 다음 이름들의 종류가 무엇인지 맞춰보자
    // 1. USER_PATH(상수)
    // 2. memberController(변수)
    // 3. MemberConroller(클래스)
    // 4. print()(메소드)    
}




