package day0219;
// 변수(Variable)
// 변수란 우리가 자바 메모리에
// 공간을 만들고 그 공간을 이름을 지어서
// 값을 저장하거나 저장된 값을 불러오게
// 할 수 있는 공간이다.

// 변수는 해당 공간에 저장되는 값을 변경할 수 있기때문에
// 변하는 수를 줄여서 변수라고한다.

// 변수는 우리가 반드시 선언이라는 것을 해서
// 스택 영역에 등록을 해야한다.
// 또한 쓰레기값이 들어가던 c같은 언어와는 달리
// 자바의 경우 변수는 초기화되지 않으면
// 사용을 할 수 없다.

// 변수의 선언은 다음과 같이 이루어진다.
// 데이터타입 이름;
// 데이터타입이란, 해당 변수가 저장 가능한 값의 종류를 말한다.
// 자료형이라고도 표현한다.
// 만약 해당 데이터타입이 처리할 수 없는 값을 저장하려고 하면 에러가 발생한다.

// 변수의 초기화는 다음과 같이 이루어진다.
// 변수이름 = 값;

// stack -> 변수 등록 메모리
// heap -> 참조형 데이터타입의 내용 등록
// method -> 해당 프로그램이 실행할 코드 등록
public class Ex04Variable {
    
}




