package day0219;
// 자료형(Data types)
// 자료형이란 해당 변수 혹은 상수에 어떤 종류의 값이 들어갈 수 있는지를
// 지정해주는 것이다.

// 데이터타입에는 크게 두 종류의 데이터타입이 존재한다.
// 1. 기본형(Primitive types)
//    기본형 데이터타입은 우리가 스텍 영역에 만들어놓은 공간에
//    2진법으로 변환된 실제 값이 그대로 저장이 돤다.
//    기본형 데이터타입은 초기 언어들부터 있던 개념이기때문에
//    원시 데이터타입이라고도 한다.
//    기본형 데이터타입에는
//    byte short int long float double char boolean
//    8가지 데이터타입들이 있다.

// 2. 참조형(Reference types)
//    참조형 데이터타입은 우리가 스텍 영역에 만들어놓은 공간에
//    주소값이 저장이 된다.
//    만약 해당 공간의 진짜 값을 알고 싶다면 그 메모리 주소값을 참조해서
//    힙 영역에 찾아가야지만 진짜 값을 알 수 있게 된다.
//    참조형 데이터타입에는
//    클래스형, 배열형, 인터페이스형
//    3가지 종류가 있다.
//    그 중 클래스형 변수는 특별히 우리가 "객체"라고 부른다.
public class Ex06DataTypes {

}
