package day0219;
// 형변환(Type Casting)
// 특정 데이터타입의 값을 다른 데이터타입으로 변경해준다.

// 형변환에는 암시적 형변환과 명시적 형변환
// 두가지 종류의 형변환이 있다.

// 암시적 형변환(implicit type casting)
// 암시적 형변환은 우리가 특별히 명령어를 적어주지 않아도
// 자료형을 변경해준다.
// 암시적 형변환은 주로 크기가 더 작은 값을 크기가 더 큰 공간에
// 초기화(=할당)할 때 발생된다.

// 명시적 형변환(explicit type casting)
// 명시적 형변환은 우리가 바꿀 값 앞에 (바꿀 데이터타입)을
// 붙여주어야한다.
// 예시 : number = (byte)100;
// 명시적 형변환은 크기가 더 큰 값을 크기가 더 작은 공간에
// 할당할 때 데이터 손실이 일어날 수 있으므로
// 우리가 데이터 손실이 일어나도 괜찮다 라는 의미로
// 적어줄 때 사용이 된다.
public class Ex07TypeCasting {

}
