package day0219;
// 연산자(Operator)
// 연산자란, 프로그램 언어가 내부적으로
// 수학적 기호에 프로그래밍 기능을 만들어 놓은 것이다.

// 연산자에는 크게 다음과 같은 종류의 연산자가 있다.
// 1. 산술연산자
//    산술연산자는 간단한 "산수"기능이 만들어져있는
//    수학적 기호이다.
//    대표적으로 (+, -, *, /, %)가 있다.

// 2. 할당연산자
//    할당연산자는 오른족에 있는 값을 연산하여 왼족 공간에
//    "할당"하는 기능이 만들어져있는 수학적 기호이다.
//    (=, +=, *=, /=, %=, ++, --)이 있다.

// 3. 비교연산자
//    비교연산자는 왼쪽의 현재 값과 오른쪽의 현재 값을 비교하여
//    그 결과가 참인지 거짓인지를 확인하는 기능이다.
//    (<, <=, >, >=, ==, !=)이 있다.

// 4. 논리연산자
//    논리연산자는 boolean 값에 대한 연산자이다.

// 5. 비트연산자
//    2진법 숫자에 대한 연산자이다. 하지만 속도가 매우 중요한 분야
//    대표적으로 이미지 처리 혹은 네트워크에서 주로 쓰이고
//    자바에서는 거의 사용하지 않는다.

public class Ex13Operator01 {

}




